###################################################################

# Created by write_sdc on Fri Dec 13 18:38:42 2019

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current uA
create_clock [get_ports clock]  -period 205  -waveform {0 102.5}
group_path -name input_grp  -from [list [get_ports clock] [get_ports reset] [get_ports enable] [get_ports \
{input_vals[1][3][3][1]}] [get_ports {input_vals[1][3][3][0]}] [get_ports      \
{input_vals[1][3][2][1]}] [get_ports {input_vals[1][3][2][0]}] [get_ports      \
{input_vals[1][3][1][1]}] [get_ports {input_vals[1][3][1][0]}] [get_ports      \
{input_vals[1][3][0][1]}] [get_ports {input_vals[1][3][0][0]}] [get_ports      \
{input_vals[1][2][3][1]}] [get_ports {input_vals[1][2][3][0]}] [get_ports      \
{input_vals[1][2][2][1]}] [get_ports {input_vals[1][2][2][0]}] [get_ports      \
{input_vals[1][2][1][1]}] [get_ports {input_vals[1][2][1][0]}] [get_ports      \
{input_vals[1][2][0][1]}] [get_ports {input_vals[1][2][0][0]}] [get_ports      \
{input_vals[1][1][3][1]}] [get_ports {input_vals[1][1][3][0]}] [get_ports      \
{input_vals[1][1][2][1]}] [get_ports {input_vals[1][1][2][0]}] [get_ports      \
{input_vals[1][1][1][1]}] [get_ports {input_vals[1][1][1][0]}] [get_ports      \
{input_vals[1][1][0][1]}] [get_ports {input_vals[1][1][0][0]}] [get_ports      \
{input_vals[1][0][3][1]}] [get_ports {input_vals[1][0][3][0]}] [get_ports      \
{input_vals[1][0][2][1]}] [get_ports {input_vals[1][0][2][0]}] [get_ports      \
{input_vals[1][0][1][1]}] [get_ports {input_vals[1][0][1][0]}] [get_ports      \
{input_vals[1][0][0][1]}] [get_ports {input_vals[1][0][0][0]}] [get_ports      \
{input_vals[0][3][3][1]}] [get_ports {input_vals[0][3][3][0]}] [get_ports      \
{input_vals[0][3][2][1]}] [get_ports {input_vals[0][3][2][0]}] [get_ports      \
{input_vals[0][3][1][1]}] [get_ports {input_vals[0][3][1][0]}] [get_ports      \
{input_vals[0][3][0][1]}] [get_ports {input_vals[0][3][0][0]}] [get_ports      \
{input_vals[0][2][3][1]}] [get_ports {input_vals[0][2][3][0]}] [get_ports      \
{input_vals[0][2][2][1]}] [get_ports {input_vals[0][2][2][0]}] [get_ports      \
{input_vals[0][2][1][1]}] [get_ports {input_vals[0][2][1][0]}] [get_ports      \
{input_vals[0][2][0][1]}] [get_ports {input_vals[0][2][0][0]}] [get_ports      \
{input_vals[0][1][3][1]}] [get_ports {input_vals[0][1][3][0]}] [get_ports      \
{input_vals[0][1][2][1]}] [get_ports {input_vals[0][1][2][0]}] [get_ports      \
{input_vals[0][1][1][1]}] [get_ports {input_vals[0][1][1][0]}] [get_ports      \
{input_vals[0][1][0][1]}] [get_ports {input_vals[0][1][0][0]}] [get_ports      \
{input_vals[0][0][3][1]}] [get_ports {input_vals[0][0][3][0]}] [get_ports      \
{input_vals[0][0][2][1]}] [get_ports {input_vals[0][0][2][0]}] [get_ports      \
{input_vals[0][0][1][1]}] [get_ports {input_vals[0][0][1][0]}] [get_ports      \
{input_vals[0][0][0][1]}] [get_ports {input_vals[0][0][0][0]}] [get_ports      \
{weight_vals[1][1]}] [get_ports {weight_vals[1][0]}] [get_ports                \
{weight_vals[0][1]}] [get_ports {weight_vals[0][0]}] [get_ports                \
{delta_vals[1][15][1]}] [get_ports {delta_vals[1][15][0]}] [get_ports          \
{delta_vals[1][14][1]}] [get_ports {delta_vals[1][14][0]}] [get_ports          \
{delta_vals[1][13][1]}] [get_ports {delta_vals[1][13][0]}] [get_ports          \
{delta_vals[1][12][1]}] [get_ports {delta_vals[1][12][0]}] [get_ports          \
{delta_vals[1][11][1]}] [get_ports {delta_vals[1][11][0]}] [get_ports          \
{delta_vals[1][10][1]}] [get_ports {delta_vals[1][10][0]}] [get_ports          \
{delta_vals[1][9][1]}] [get_ports {delta_vals[1][9][0]}] [get_ports            \
{delta_vals[1][8][1]}] [get_ports {delta_vals[1][8][0]}] [get_ports            \
{delta_vals[1][7][1]}] [get_ports {delta_vals[1][7][0]}] [get_ports            \
{delta_vals[1][6][1]}] [get_ports {delta_vals[1][6][0]}] [get_ports            \
{delta_vals[1][5][1]}] [get_ports {delta_vals[1][5][0]}] [get_ports            \
{delta_vals[1][4][1]}] [get_ports {delta_vals[1][4][0]}] [get_ports            \
{delta_vals[1][3][1]}] [get_ports {delta_vals[1][3][0]}] [get_ports            \
{delta_vals[1][2][1]}] [get_ports {delta_vals[1][2][0]}] [get_ports            \
{delta_vals[1][1][1]}] [get_ports {delta_vals[1][1][0]}] [get_ports            \
{delta_vals[1][0][1]}] [get_ports {delta_vals[1][0][0]}] [get_ports            \
{delta_vals[0][15][1]}] [get_ports {delta_vals[0][15][0]}] [get_ports          \
{delta_vals[0][14][1]}] [get_ports {delta_vals[0][14][0]}] [get_ports          \
{delta_vals[0][13][1]}] [get_ports {delta_vals[0][13][0]}] [get_ports          \
{delta_vals[0][12][1]}] [get_ports {delta_vals[0][12][0]}] [get_ports          \
{delta_vals[0][11][1]}] [get_ports {delta_vals[0][11][0]}] [get_ports          \
{delta_vals[0][10][1]}] [get_ports {delta_vals[0][10][0]}] [get_ports          \
{delta_vals[0][9][1]}] [get_ports {delta_vals[0][9][0]}] [get_ports            \
{delta_vals[0][8][1]}] [get_ports {delta_vals[0][8][0]}] [get_ports            \
{delta_vals[0][7][1]}] [get_ports {delta_vals[0][7][0]}] [get_ports            \
{delta_vals[0][6][1]}] [get_ports {delta_vals[0][6][0]}] [get_ports            \
{delta_vals[0][5][1]}] [get_ports {delta_vals[0][5][0]}] [get_ports            \
{delta_vals[0][4][1]}] [get_ports {delta_vals[0][4][0]}] [get_ports            \
{delta_vals[0][3][1]}] [get_ports {delta_vals[0][3][0]}] [get_ports            \
{delta_vals[0][2][1]}] [get_ports {delta_vals[0][2][0]}] [get_ports            \
{delta_vals[0][1][1]}] [get_ports {delta_vals[0][1][0]}] [get_ports            \
{delta_vals[0][0][1]}] [get_ports {delta_vals[0][0][0]}] [get_ports            \
{delta_sims[1][15][2]}] [get_ports {delta_sims[1][15][1]}] [get_ports          \
{delta_sims[1][15][0]}] [get_ports {delta_sims[1][14][2]}] [get_ports          \
{delta_sims[1][14][1]}] [get_ports {delta_sims[1][14][0]}] [get_ports          \
{delta_sims[1][13][2]}] [get_ports {delta_sims[1][13][1]}] [get_ports          \
{delta_sims[1][13][0]}] [get_ports {delta_sims[1][12][2]}] [get_ports          \
{delta_sims[1][12][1]}] [get_ports {delta_sims[1][12][0]}] [get_ports          \
{delta_sims[1][11][2]}] [get_ports {delta_sims[1][11][1]}] [get_ports          \
{delta_sims[1][11][0]}] [get_ports {delta_sims[1][10][2]}] [get_ports          \
{delta_sims[1][10][1]}] [get_ports {delta_sims[1][10][0]}] [get_ports          \
{delta_sims[1][9][2]}] [get_ports {delta_sims[1][9][1]}] [get_ports            \
{delta_sims[1][9][0]}] [get_ports {delta_sims[1][8][2]}] [get_ports            \
{delta_sims[1][8][1]}] [get_ports {delta_sims[1][8][0]}] [get_ports            \
{delta_sims[1][7][2]}] [get_ports {delta_sims[1][7][1]}] [get_ports            \
{delta_sims[1][7][0]}] [get_ports {delta_sims[1][6][2]}] [get_ports            \
{delta_sims[1][6][1]}] [get_ports {delta_sims[1][6][0]}] [get_ports            \
{delta_sims[1][5][2]}] [get_ports {delta_sims[1][5][1]}] [get_ports            \
{delta_sims[1][5][0]}] [get_ports {delta_sims[1][4][2]}] [get_ports            \
{delta_sims[1][4][1]}] [get_ports {delta_sims[1][4][0]}] [get_ports            \
{delta_sims[1][3][2]}] [get_ports {delta_sims[1][3][1]}] [get_ports            \
{delta_sims[1][3][0]}] [get_ports {delta_sims[1][2][2]}] [get_ports            \
{delta_sims[1][2][1]}] [get_ports {delta_sims[1][2][0]}] [get_ports            \
{delta_sims[1][1][2]}] [get_ports {delta_sims[1][1][1]}] [get_ports            \
{delta_sims[1][1][0]}] [get_ports {delta_sims[1][0][2]}] [get_ports            \
{delta_sims[1][0][1]}] [get_ports {delta_sims[1][0][0]}] [get_ports            \
{delta_sims[0][15][2]}] [get_ports {delta_sims[0][15][1]}] [get_ports          \
{delta_sims[0][15][0]}] [get_ports {delta_sims[0][14][2]}] [get_ports          \
{delta_sims[0][14][1]}] [get_ports {delta_sims[0][14][0]}] [get_ports          \
{delta_sims[0][13][2]}] [get_ports {delta_sims[0][13][1]}] [get_ports          \
{delta_sims[0][13][0]}] [get_ports {delta_sims[0][12][2]}] [get_ports          \
{delta_sims[0][12][1]}] [get_ports {delta_sims[0][12][0]}] [get_ports          \
{delta_sims[0][11][2]}] [get_ports {delta_sims[0][11][1]}] [get_ports          \
{delta_sims[0][11][0]}] [get_ports {delta_sims[0][10][2]}] [get_ports          \
{delta_sims[0][10][1]}] [get_ports {delta_sims[0][10][0]}] [get_ports          \
{delta_sims[0][9][2]}] [get_ports {delta_sims[0][9][1]}] [get_ports            \
{delta_sims[0][9][0]}] [get_ports {delta_sims[0][8][2]}] [get_ports            \
{delta_sims[0][8][1]}] [get_ports {delta_sims[0][8][0]}] [get_ports            \
{delta_sims[0][7][2]}] [get_ports {delta_sims[0][7][1]}] [get_ports            \
{delta_sims[0][7][0]}] [get_ports {delta_sims[0][6][2]}] [get_ports            \
{delta_sims[0][6][1]}] [get_ports {delta_sims[0][6][0]}] [get_ports            \
{delta_sims[0][5][2]}] [get_ports {delta_sims[0][5][1]}] [get_ports            \
{delta_sims[0][5][0]}] [get_ports {delta_sims[0][4][2]}] [get_ports            \
{delta_sims[0][4][1]}] [get_ports {delta_sims[0][4][0]}] [get_ports            \
{delta_sims[0][3][2]}] [get_ports {delta_sims[0][3][1]}] [get_ports            \
{delta_sims[0][3][0]}] [get_ports {delta_sims[0][2][2]}] [get_ports            \
{delta_sims[0][2][1]}] [get_ports {delta_sims[0][2][0]}] [get_ports            \
{delta_sims[0][1][2]}] [get_ports {delta_sims[0][1][1]}] [get_ports            \
{delta_sims[0][1][0]}] [get_ports {delta_sims[0][0][2]}] [get_ports            \
{delta_sims[0][0][1]}] [get_ports {delta_sims[0][0][0]}] [get_ports            \
{index_vals[1][15][3]}] [get_ports {index_vals[1][15][2]}] [get_ports          \
{index_vals[1][15][1]}] [get_ports {index_vals[1][15][0]}] [get_ports          \
{index_vals[1][14][3]}] [get_ports {index_vals[1][14][2]}] [get_ports          \
{index_vals[1][14][1]}] [get_ports {index_vals[1][14][0]}] [get_ports          \
{index_vals[1][13][3]}] [get_ports {index_vals[1][13][2]}] [get_ports          \
{index_vals[1][13][1]}] [get_ports {index_vals[1][13][0]}] [get_ports          \
{index_vals[1][12][3]}] [get_ports {index_vals[1][12][2]}] [get_ports          \
{index_vals[1][12][1]}] [get_ports {index_vals[1][12][0]}] [get_ports          \
{index_vals[1][11][3]}] [get_ports {index_vals[1][11][2]}] [get_ports          \
{index_vals[1][11][1]}] [get_ports {index_vals[1][11][0]}] [get_ports          \
{index_vals[1][10][3]}] [get_ports {index_vals[1][10][2]}] [get_ports          \
{index_vals[1][10][1]}] [get_ports {index_vals[1][10][0]}] [get_ports          \
{index_vals[1][9][3]}] [get_ports {index_vals[1][9][2]}] [get_ports            \
{index_vals[1][9][1]}] [get_ports {index_vals[1][9][0]}] [get_ports            \
{index_vals[1][8][3]}] [get_ports {index_vals[1][8][2]}] [get_ports            \
{index_vals[1][8][1]}] [get_ports {index_vals[1][8][0]}] [get_ports            \
{index_vals[1][7][3]}] [get_ports {index_vals[1][7][2]}] [get_ports            \
{index_vals[1][7][1]}] [get_ports {index_vals[1][7][0]}] [get_ports            \
{index_vals[1][6][3]}] [get_ports {index_vals[1][6][2]}] [get_ports            \
{index_vals[1][6][1]}] [get_ports {index_vals[1][6][0]}] [get_ports            \
{index_vals[1][5][3]}] [get_ports {index_vals[1][5][2]}] [get_ports            \
{index_vals[1][5][1]}] [get_ports {index_vals[1][5][0]}] [get_ports            \
{index_vals[1][4][3]}] [get_ports {index_vals[1][4][2]}] [get_ports            \
{index_vals[1][4][1]}] [get_ports {index_vals[1][4][0]}] [get_ports            \
{index_vals[1][3][3]}] [get_ports {index_vals[1][3][2]}] [get_ports            \
{index_vals[1][3][1]}] [get_ports {index_vals[1][3][0]}] [get_ports            \
{index_vals[1][2][3]}] [get_ports {index_vals[1][2][2]}] [get_ports            \
{index_vals[1][2][1]}] [get_ports {index_vals[1][2][0]}] [get_ports            \
{index_vals[1][1][3]}] [get_ports {index_vals[1][1][2]}] [get_ports            \
{index_vals[1][1][1]}] [get_ports {index_vals[1][1][0]}] [get_ports            \
{index_vals[1][0][3]}] [get_ports {index_vals[1][0][2]}] [get_ports            \
{index_vals[1][0][1]}] [get_ports {index_vals[1][0][0]}] [get_ports            \
{index_vals[0][15][3]}] [get_ports {index_vals[0][15][2]}] [get_ports          \
{index_vals[0][15][1]}] [get_ports {index_vals[0][15][0]}] [get_ports          \
{index_vals[0][14][3]}] [get_ports {index_vals[0][14][2]}] [get_ports          \
{index_vals[0][14][1]}] [get_ports {index_vals[0][14][0]}] [get_ports          \
{index_vals[0][13][3]}] [get_ports {index_vals[0][13][2]}] [get_ports          \
{index_vals[0][13][1]}] [get_ports {index_vals[0][13][0]}] [get_ports          \
{index_vals[0][12][3]}] [get_ports {index_vals[0][12][2]}] [get_ports          \
{index_vals[0][12][1]}] [get_ports {index_vals[0][12][0]}] [get_ports          \
{index_vals[0][11][3]}] [get_ports {index_vals[0][11][2]}] [get_ports          \
{index_vals[0][11][1]}] [get_ports {index_vals[0][11][0]}] [get_ports          \
{index_vals[0][10][3]}] [get_ports {index_vals[0][10][2]}] [get_ports          \
{index_vals[0][10][1]}] [get_ports {index_vals[0][10][0]}] [get_ports          \
{index_vals[0][9][3]}] [get_ports {index_vals[0][9][2]}] [get_ports            \
{index_vals[0][9][1]}] [get_ports {index_vals[0][9][0]}] [get_ports            \
{index_vals[0][8][3]}] [get_ports {index_vals[0][8][2]}] [get_ports            \
{index_vals[0][8][1]}] [get_ports {index_vals[0][8][0]}] [get_ports            \
{index_vals[0][7][3]}] [get_ports {index_vals[0][7][2]}] [get_ports            \
{index_vals[0][7][1]}] [get_ports {index_vals[0][7][0]}] [get_ports            \
{index_vals[0][6][3]}] [get_ports {index_vals[0][6][2]}] [get_ports            \
{index_vals[0][6][1]}] [get_ports {index_vals[0][6][0]}] [get_ports            \
{index_vals[0][5][3]}] [get_ports {index_vals[0][5][2]}] [get_ports            \
{index_vals[0][5][1]}] [get_ports {index_vals[0][5][0]}] [get_ports            \
{index_vals[0][4][3]}] [get_ports {index_vals[0][4][2]}] [get_ports            \
{index_vals[0][4][1]}] [get_ports {index_vals[0][4][0]}] [get_ports            \
{index_vals[0][3][3]}] [get_ports {index_vals[0][3][2]}] [get_ports            \
{index_vals[0][3][1]}] [get_ports {index_vals[0][3][0]}] [get_ports            \
{index_vals[0][2][3]}] [get_ports {index_vals[0][2][2]}] [get_ports            \
{index_vals[0][2][1]}] [get_ports {index_vals[0][2][0]}] [get_ports            \
{index_vals[0][1][3]}] [get_ports {index_vals[0][1][2]}] [get_ports            \
{index_vals[0][1][1]}] [get_ports {index_vals[0][1][0]}] [get_ports            \
{index_vals[0][0][3]}] [get_ports {index_vals[0][0][2]}] [get_ports            \
{index_vals[0][0][1]}] [get_ports {index_vals[0][0][0]}]]
group_path -name output_grp  -to [list [get_ports {output_vals[1][2][2][3]}] [get_ports                    \
{output_vals[1][2][2][2]}] [get_ports {output_vals[1][2][2][1]}] [get_ports    \
{output_vals[1][2][2][0]}] [get_ports {output_vals[1][2][1][3]}] [get_ports    \
{output_vals[1][2][1][2]}] [get_ports {output_vals[1][2][1][1]}] [get_ports    \
{output_vals[1][2][1][0]}] [get_ports {output_vals[1][2][0][3]}] [get_ports    \
{output_vals[1][2][0][2]}] [get_ports {output_vals[1][2][0][1]}] [get_ports    \
{output_vals[1][2][0][0]}] [get_ports {output_vals[1][1][2][3]}] [get_ports    \
{output_vals[1][1][2][2]}] [get_ports {output_vals[1][1][2][1]}] [get_ports    \
{output_vals[1][1][2][0]}] [get_ports {output_vals[1][1][1][3]}] [get_ports    \
{output_vals[1][1][1][2]}] [get_ports {output_vals[1][1][1][1]}] [get_ports    \
{output_vals[1][1][1][0]}] [get_ports {output_vals[1][1][0][3]}] [get_ports    \
{output_vals[1][1][0][2]}] [get_ports {output_vals[1][1][0][1]}] [get_ports    \
{output_vals[1][1][0][0]}] [get_ports {output_vals[1][0][2][3]}] [get_ports    \
{output_vals[1][0][2][2]}] [get_ports {output_vals[1][0][2][1]}] [get_ports    \
{output_vals[1][0][2][0]}] [get_ports {output_vals[1][0][1][3]}] [get_ports    \
{output_vals[1][0][1][2]}] [get_ports {output_vals[1][0][1][1]}] [get_ports    \
{output_vals[1][0][1][0]}] [get_ports {output_vals[1][0][0][3]}] [get_ports    \
{output_vals[1][0][0][2]}] [get_ports {output_vals[1][0][0][1]}] [get_ports    \
{output_vals[1][0][0][0]}] [get_ports {output_vals[0][2][2][3]}] [get_ports    \
{output_vals[0][2][2][2]}] [get_ports {output_vals[0][2][2][1]}] [get_ports    \
{output_vals[0][2][2][0]}] [get_ports {output_vals[0][2][1][3]}] [get_ports    \
{output_vals[0][2][1][2]}] [get_ports {output_vals[0][2][1][1]}] [get_ports    \
{output_vals[0][2][1][0]}] [get_ports {output_vals[0][2][0][3]}] [get_ports    \
{output_vals[0][2][0][2]}] [get_ports {output_vals[0][2][0][1]}] [get_ports    \
{output_vals[0][2][0][0]}] [get_ports {output_vals[0][1][2][3]}] [get_ports    \
{output_vals[0][1][2][2]}] [get_ports {output_vals[0][1][2][1]}] [get_ports    \
{output_vals[0][1][2][0]}] [get_ports {output_vals[0][1][1][3]}] [get_ports    \
{output_vals[0][1][1][2]}] [get_ports {output_vals[0][1][1][1]}] [get_ports    \
{output_vals[0][1][1][0]}] [get_ports {output_vals[0][1][0][3]}] [get_ports    \
{output_vals[0][1][0][2]}] [get_ports {output_vals[0][1][0][1]}] [get_ports    \
{output_vals[0][1][0][0]}] [get_ports {output_vals[0][0][2][3]}] [get_ports    \
{output_vals[0][0][2][2]}] [get_ports {output_vals[0][0][2][1]}] [get_ports    \
{output_vals[0][0][2][0]}] [get_ports {output_vals[0][0][1][3]}] [get_ports    \
{output_vals[0][0][1][2]}] [get_ports {output_vals[0][0][1][1]}] [get_ports    \
{output_vals[0][0][1][0]}] [get_ports {output_vals[0][0][0][3]}] [get_ports    \
{output_vals[0][0][0][2]}] [get_ports {output_vals[0][0][0][1]}] [get_ports    \
{output_vals[0][0][0][0]}] [get_ports done]]
set_max_delay 205  -to [get_ports {output_vals[1][2][2][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][2][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][2][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][2][0]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][1][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][1][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][1][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][1][0]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][0][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][0][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][0][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][2][0][0]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][2][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][2][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][2][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][2][0]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][1][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][1][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][1][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][1][0]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][0][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][0][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][0][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][1][0][0]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][2][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][2][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][2][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][2][0]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][1][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][1][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][1][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][1][0]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][0][3]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][0][2]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][0][1]}]
set_max_delay 205  -to [get_ports {output_vals[1][0][0][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][2][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][2][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][2][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][2][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][1][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][1][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][1][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][1][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][0][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][0][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][0][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][2][0][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][2][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][2][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][2][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][2][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][1][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][1][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][1][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][1][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][0][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][0][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][0][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][1][0][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][2][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][2][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][2][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][2][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][1][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][1][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][1][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][1][0]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][0][3]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][0][2]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][0][1]}]
set_max_delay 205  -to [get_ports {output_vals[0][0][0][0]}]
set_max_delay 205  -to [get_ports done]
set_resistance 0  [get_nets reset]
